In [1]:
import pandas as pd

school_id_list = [{'name':'John', 'job':'teacher', 'age':40},
                 {'name':'Clara', 'job':'teacher', 'age':None},
                 {'name':'Brian', 'job':'student', 'age':13},
                 {'name':'Lea', 'job':'student', 'age':10},
                 {'name':'Anna', 'job':'teacher', 'age':32},
                 {'name':'Felix', 'job':'student', 'age':None}]

df = pd.DataFrame (school_id_list, columns = ['name', 'job', 'age'])

In [2]:
df

    name      job   age
0   John  teacher  40.0
1  Clara  teacher   NaN
2  Brian  student  13.0
3    Lea  student  10.0
4   Anna  teacher  32.0
5  Felix  student   NaN

In [21]:
df.shape

(6, 3)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   job     6 non-null      object
 2   age     4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [3]:
df.age = df.age.fillna(0)

In [5]:
df.sort_values('job')

    name      job   age
2  Brian  student  13.0
3    Lea  student  10.0
5  Felix  student   0.0
0   John  teacher  40.0
1  Clara  teacher   0.0
4   Anna  teacher  32.0

In [12]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True)

df

    name      job   age
0   John  teacher  40.0
1  Clara  teacher  36.0
2  Brian  student  13.0
3    Lea  student  10.0
4   Anna  teacher  32.0
5  Felix  student  11.5